app/views/tags/_tag.html.erb


<% @tag.posts.each do |post| %>
---
SELECT "posts".* FROM "posts" INNER JOIN "post_tags" ON "posts"."id" = "post_tags"."post_id" WHERE "post_tags"."tag_id" = $1  [["tag_id", 1]]