app/views/posts/_post_view.html.erb

SELECT "tags".* FROM "tags"  WHERE "tags"."post_id" = $1  [["post_id", 1]]
---
<ul>
  <% @post.tags.each do |tag| %>